#Использовать json

Функция Соединение(Сервер = "localhost", Порт=8080)
	Возврат Новый HTTPСоединение(Сервер, Порт);
КонецФункции

Функция ПолучитьHttpЗапрос(ИмяСвойства, ЗначениеСвойства)
	Запрос = Новый HTTPЗапрос("/");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON);	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства(ИмяСвойства);
	ЗаписьJSON.ЗаписатьЗначение(ЗначениеСвойства);
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	Запрос.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть(), "UTF-8");
	
	Возврат Запрос;
КонецФункции

Функция ПолучитьРезультатЗапросаКСервису(Соединение, Запрос)	
	
	Попытка
		Возврат Соединение.ОтправитьДляОбработки(Запрос);	
	Исключение
		ВызватьИсключение "Не удалось выполнить проверку орфографии с помощью сервиса.." + ИнформацияОбОшибке();
	КонецПопытки;
	
КонецФункции

Функция ПрочитатьJSONРезультатаЗапроса(РезультатЗапроса)
	ПарсерJSON = Новый ПарсерJSON();	
	Возврат ПарсерJSON.ПрочитатьJSON(РезультатЗапроса.ПолучитьТелоКакСтроку("UTF-8"));
КонецФункции

Функция ВозможныеВариантыСлов(Массив)
	Варианты = "";
	Сч2 = 0;
	Для Каждого Слово Из Массив Цикл
		Варианты = Варианты + Слово+ " ";
		Сч2 = Сч2 + 1;
	КонецЦикла;
	Возврат Варианты;
КонецФункции

Функция ПроверкаСлова(Слово)
	
	Соединение = Соединение();
	
	Запрос = ПолучитьHttpЗапрос("word", Слово);
	
	РезультатЗапросаКСервису = ПолучитьРезультатЗапросаКСервису(Соединение, Запрос);
	
	Если РезультатЗапросаКСервису <> Неопределено Тогда
		
		РезультатЧтения = ПрочитатьJSONРезультатаЗапроса(РезультатЗапросаКСервису);
		
		Если ТипЗнч(РезультатЧтения) = Тип("Булево") Тогда
			Сообщить(РезультатЧтения);
		КонецЕсли;
		
		Если ТипЗнч(РезультатЧтения) = Тип("Массив") Тогда	
			Варианты = ВозможныеВариантыСлов(РезультатЧтения);
			Сообщить("Орфографическая ошибка: "+Слово);
			Сообщить(Символы.Tab+" возможные варианты: " + Варианты);
		КонецЕсли;
		
	КонецЕсли;
КонецФункции	

Функция ПроверкаТекста(Текст)
	
	Соединение = Соединение();
	
	Запрос = ПолучитьHttpЗапрос("text", Текст);
	
	РезультатЗапросаКСервису = ПолучитьРезультатЗапросаКСервису(Соединение, Запрос);
	
	Если РезультатЗапросаКСервису <> Неопределено Тогда
		
		РезультатЧтения = ПрочитатьJSONРезультатаЗапроса(РезультатЗапросаКСервису);
		
		Если ТипЗнч(РезультатЧтения) = Тип("Булево") Тогда
			Сообщить(РезультатЧтения);
		КонецЕсли;
		
		Если ТипЗнч(РезультатЧтения) = Тип("Массив") Тогда
			Сч = 0;
			Для Каждого Эл Из РезультатЧтения Цикл
				Варианты = ВозможныеВариантыСлов(Эл[1]);
				Сообщить("Орфографическая ошибка: "+Эл[0]);
				Сообщить(Символы.Tab+" возможные варианты: " + Варианты);
				Сч = Сч + 1;
			КонецЦикла;	
		КонецЕсли;
		
	КонецЕсли;
		
КонецФункции

//ПроверкаСлова("Приветф");
ПроверкаТекста("Текст с ошибкамы");
