#Использовать json

Функция ПроверкаСлова(Слово)
	
	Соединение = Новый HTTPСоединение("localhost",8080);
	Запрос = Новый HTTPЗапрос("/");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON);	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("word");
	ЗаписьJSON.ЗаписатьЗначение(Слово);
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	Запрос.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть(), "UTF-8");
	
	РезультатЗапросаКСервису = Неопределено;
	Попытка

		РезультатЗапросаКСервису = Соединение.ОтправитьДляОбработки(Запрос);
		ПарсерJSON = Новый ПарсерJSON();	
		РезультатЧтения = ПарсерJSON.ПрочитатьJSON(РезультатЗапросаКСервису.ПолучитьТелоКакСтроку("UTF-8"));
		
		Если ТипЗнч(РезультатЧтения) = Тип("Булево") Тогда
			Сообщить(РезультатЧтения);
		КонецЕсли;
		
		Если ТипЗнч(РезультатЧтения) = Тип("Массив") Тогда
			Сч = 0;
			Для Каждого Эл Из РезультатЧтения Цикл
				Сообщить(Эл);
				Сч = Сч + 1;
			КонецЦикла;
		КонецЕсли;
		
	Исключение
		Сообщить("Не удалось выполнить склонение с помощью сервиса..");
	КонецПопытки;
	
	
КонецФункции	

Функция ПроверкаТекста(Текст)
	
	Соединение = Новый HTTPСоединение("localhost",8080);
	Запрос = Новый HTTPЗапрос("/");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON);	
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	
	ЗаписьJSON.ЗаписатьИмяСвойства("text");
	ЗаписьJSON.ЗаписатьЗначение(Текст);
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	Запрос.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть(), "UTF-8");
	
	РезультатЗапросаКСервису = Неопределено;
	Попытка

		РезультатЗапросаКСервису = Соединение.ОтправитьДляОбработки(Запрос);
		ПарсерJSON = Новый ПарсерJSON();	
		РезультатЧтения = ПарсерJSON.ПрочитатьJSON(РезультатЗапросаКСервису.ПолучитьТелоКакСтроку("UTF-8"));
		
		Сообщить(ТипЗнч(РезультатЧтения)); 

		Если ТипЗнч(РезультатЧтения) = Тип("Булево") Тогда
			Сообщить(РезультатЧтения);
		КонецЕсли;
		
		Если ТипЗнч(РезультатЧтения) = Тип("Массив") Тогда
			Сч = 0;
			Для Каждого Эл Из РезультатЧтения Цикл
				
				Сообщить("Неправельное слово: "+Эл[0]);
					
				Варианты = "";
				Сч2 = 0;
				Для Каждого Слово Из ЭЛ[1] Цикл
					Варианты = Варианты + Слово+ " ";
					Сч2 = Сч2 + 1;
				КонецЦикла;
				Сообщить(""+Символы.Tab+"варианты: "+Варианты);
				Сч = Сч + 1;
			КонецЦикла;
		КонецЕсли;
		
	Исключение
		Сообщить("Не удалось выполнить склонение с помощью сервиса..");
	КонецПопытки;
	
	
КонецФункции

//ПроверкаСлова("Привет");
ПроверкаТекста("Текст с ошибкамы");
